<?php
	//$pattern = "/(([(0-9)|(a-z)|(A-Z)|一|二|三|四|五|六|七|八|九|零|壹|贰|叁|肆|伍|陆|柒|捌|玖]+)(幢|栋|寓|号|号楼|楼|园|单元|村|座|排|弄|棟|幅|村|坐|座|期|撞|区|懂|～|#|-|－|/ |/|_){1,2})([(0-9)|(a-z)|(A-Z)|一|二|三|四|五|六|七|八|九|零|壹|贰|叁|肆|伍|陆|柒|捌|玖]+)?)/";
	$pattern = "((([(0-9)|(a-z)|(A-Z)|一|二|三|四|五|六|七|八|九|零|壹|贰|叁|肆|伍|陆|柒|捌|玖]+)(幢|栋|寓|号|号楼|楼|园|单元|村|座|排|弄|棟|幅|村|坐|座|期|撞|区|懂|室|～|#|-|－|/ |/|_){1,2})(([(0-9)|(a-z)|(A-Z)|一|二|三|四|五|六|七|八|九|零|壹|贰|叁|肆|伍|陆|柒|捌|玖]+)?)($))";
	//$inPattern = "(服务|装饰|管理处|物业|民政局|车行|驾校|宣传部|艺术团|法院|设备|研究所|停车场|健身|商城|逆龄|物资|女红|交汇|收银台|铺|公园|司法局|门卫|客房|派出所|公安局|仓库|沙县|厂|加油站|口腔|创E慧谷|教育|门诊|学堂|画院|护肤|学堂|产后|警务室|大学|小学|中学|店|幼儿园|公司|广场|银行|服务站|工业园|市场|超市|保安室|旅馆|消控室|药房|监控室|学校|学苑|学院|书院|会所|中介|棋牌室|生活馆|宾馆|酒店|养生馆|村委会|医院|娱乐|物业|公交站|购物|书城|俱乐部|商场|教学|卫生|护理|美容|美发|听力|少年宫|办事处|建材)";
	$addrList = [
		['壹品君园10栋', 1, 1],
		['中益商务酒店对面开发大道503号', 1, 0],
		['中益商务酒店对面开发大道503号水井坊', 0, 0],
		['翰香景庭，13幢1803室', 1, 0]
	];
	foreach($addrList as $addr){
		$ret = preg_match($pattern, $addr[0], $matches, PREG_OFFSET_CAPTURE);
		if($ret !== $addr[1]) {
			echo $addr[0] . " check error \n";
			print_r($matches);
		}	
		// $ret = preg_match($inPattern, $addr[0], $matches, PREG_OFFSET_CAPTURE);
		// if($ret !== $addr[2]) {
		//	echo $addr[0] . " check error \n";
		//	print_r($matches);
		//}	
	}
	
?>
